In [1]:
import mysql.connector
import pandas as pd

In [2]:
conn = mysql.connector.connect(host =  "localhost",
                                user = "root",
                                passwd = "root",
                                database= "pythonpractice", #created this db in the next script.
                                port = "3306")
mycursor= conn.cursor()

In [ ]:
#mycursor.execute("CREATE DATABASE pythonpractice") #-- creates the database

In [7]:
mycursor.execute("DROP TABLE IF EXISTS practice") #Drops the table in case it already exists. Could get an error                                          on the first run.
mycursor.execute("CREATE TABLE practice (id INT PRIMARY KEY AUTO_INCREMENT, FirstName VARCHAR(20), LastName VARCHAR(20), Number INT)") #Autoincrement allows for unique primary keys on each entry.

In [8]:
##Describes the structure of the table

mycursor.execute("DESCRIBE practice")

for x in mycursor:
    print(x)

('id', b'int', 'NO', 'PRI', None, 'auto_increment')
('FirstName', b'varchar(20)', 'YES', '', None, '')
('LastName', b'varchar(20)', 'YES', '', None, '')
('Number', b'int', 'YES', '', None, '')

In [14]:
###Insert values
mycursor.execute("INSERT INTO practice VALUES (0, 'Rochel', 'Friedman', 70)")
                #"INSERT INTO practice (FirstName, LastName, Number) Values (%s, %s, %s)", ('Shua', 'Friedman', 23))
conn.commit()
conn.close()

In [10]:
###Show Table in editor
mycursor.execute("SELECT * FROM practice")
for x in mycursor:
    print(x)

(1, 'Rochel', 'Friedman', 70)

In [11]:
##Use pandas to show the table
practice_table = pd.read_sql_query("SELECT * FROM pythonpractice.practice", conn)
practice_table

   id FirstName  LastName  Number
0   1    Rochel  Friedman      70

In [21]:
##DATABASE WITH MULTIPLE TABLES
#This code will display all of the tables in a database.
conn = mysql.connector.connect(host =  "localhost",
                                user = "root",
                                passwd = "root",
                                database= "new_schema") 
mycursor= conn.cursor()
show_database_tables = pd.read_sql_query("SHOW TABLES FROM new_schema", conn)
show_database_tables

  Tables_in_new_schema
0          departments
1            employees
2          job_history
3                 jobs
4            locations

In [22]:
###Show the schema for all tables in a database
tables = show_database_tables['Tables_in_new_schema'] #This is the title of the table created above.
for table_name in tables:
    output = pd.read_sql_query("DESCRIBE {}" .format(table_name), conn)
    print(table_name)
    print(output, '/n')
conn.close()

departments
         Field            Type Null  Key Default Extra
0  DEPT_ID_DEP      b'char(9)'   NO  PRI    None
1     DEP_NAME  b'varchar(15)'  YES         None
2   MANAGER_ID      b'char(9)'  YES         None
3       LOC_ID      b'char(9)'  YES         None       /n
employees
         Field              Type Null  Key Default Extra
0       EMP_ID        b'char(9)'   NO  PRI    None
1       F_NAME    b'varchar(15)'   NO         None
2       L_NAME    b'varchar(15)'   NO         None
3          SSN        b'char(9)'  YES         None
4       B_DATE    b'varchar(10)'  YES         None
5          SEX        b'char(1)'  YES         None
6      ADDRESS    b'varchar(30)'  YES         None
7       JOB_ID        b'char(9)'  YES         None
8       SALARY  b'decimal(10,2)'  YES         None
9   MANAGER_ID        b'char(9)'  YES         None
10      DEP_ID        b'char(9)'   NO         None       /n
job_history
        Field            Type Null  Key Default Extra
0     EMPL_ID      b'char(9)'   NO  PRI    None
1  START_DATE  b'varchar(10)'  YES         None
2     JOBS_ID      b'char(9)'   NO  PRI    None
3     DEPT_ID      b'char(9)'  YES         None       /n
jobs
        Field              Type Null  Key Default Extra
0   JOB_IDENT        b'char(9)'   NO  PRI    None
1   JOB_TITLE    b'varchar(15)'  YES         None
2  MIN_SALARY  b'decimal(10,2)'  YES         None
3  MAX_SALARY  b'decimal(10,2)'  YES         None       /n
locations
        Field        Type Null  Key Default Extra
0     LOCT_ID  b'char(9)'   NO  PRI    None
1  DEP_ID_LOC  b'char(9)'   NO  PRI    None       /n